In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2)],
    names=['n', 'v']))

In [5]:
# df row에 대한 값 비교
df[df.a <= 5]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [6]:
# df에 대한 값 비교
df[df['c'] > 11]

     a  b   c
n v
e 2  6  9  12

In [8]:
# 중복되는 값이 존재하는 df
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2), ('e', 3)],
    names=['n', 'v']))

In [9]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [10]:
# 중복되는 값들 지우기
df.drop_duplicates()
# 괄호 안에 inplace=True 하면 값 자체가 지워짐
#(아무것도 없으면 임의로 안 보이게 되는 것)

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [11]:
# 중복되는 값들 지우기
# keep을 이용해서 어느 위치에 있는 것을 표시할지 나타냄
df.drop_duplicates(keep='last')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [16]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2)],
    names=['n', 'v']))

In [17]:
# clumn의 값 비교 가능
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [18]:
# 조건에 맞는 df 추출
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [22]:
# 해당 column의 값이 포함되어 있는지 확인
# 찾고자 하는 값은 list 형태로
df['a'].isin([5, 6])

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

In [24]:
# null 값이 존재하는 df
import numpy as np

df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6, np.nan],
    "b" : [7, 8, 9, np.nan, 9],
    "c" : [10, np.nan, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2), ('e', 3), ('e', 4)],
    names=['n', 'v']))

In [25]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN
e 2  6.0  9.0  11.0
  3  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [27]:
# null인 값 확인
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False   True
e 2  False  False  False
  3  False   True  False
  4   True  False  False

In [28]:
df['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [29]:
# null인 값 개수
df['a'].isnull().sum()

1

In [30]:
# notnull인 값 확인
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True  False
e 2   True   True   True
  3   True  False   True
  4  False   True   True

In [31]:
df.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True  False
e 2   True   True   True
  3   True  False   True
  4  False   True   True

In [32]:
# not null인 값 개수
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [33]:
# column에 대한 not null인 값 개수
df.a.notnull().sum()

4

In [46]:
# &(and), |(or), ~(not)
df[(df.b == 7) | (df.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN

In [50]:
# 상위 row 가지고 오기 (파라미터 없으면 5개)
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN

In [52]:
# 하위 row 가지고 오기 (파라미터 없으면 5개)
df.tail(2)

       a    b     c
n v
e 3  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [54]:
# 특정 비율로 sampling - random 하게 가지고 옴 (순서 변동됨)
df.sample(frac=0.5)

       a    b     c
n v
e 3  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [57]:
# 특정 개수만큼 sampling - random 하게 가지고 옴 (순서 변동됨)
df.sample(n = 4)

       a    b     c
n v
e 4  NaN  9.0  12.0
  3  6.0  NaN  12.0
d 2  5.0  8.0   NaN
e 2  6.0  9.0  11.0

In [58]:
# 시작하는 위치부터 끝 위치까지 설정하여 가지고 오기
df.iloc[1:2]

       a    b   c
n v
d 2  5.0  8.0 NaN

In [63]:
df = pd.DataFrame({'a' : [1, 10, 8, 11, -1],
                'b' : list('abced'),
                'c' : [1.0, 2.0, np.nan, 3.0, 4.0]})

In [64]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  e  3.0
4  -1  d  4.0

In [67]:
df.nlargest(2, 'c')

    a  b    c
4  -1  d  4.0
3  11  e  3.0